
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
{  
   "keras_version":"2.0.2",
   "backend":"theano",
   "config":[  
      {  
         "config":{  
            "dtype":"float32",
            "bias_regularizer":null,
            "activation":"relu",
            "bias_constraint":null,
            "use_bias":true,
            "bias_initializer":{  
               "config":{  
 
               },
               "class_name":"Zeros"
            },
            "kernel_regularizer":null,
            "activity_regularizer":null,
            "kernel_constraint":null,
            "trainable":true,
            "name":"dense_1",
            "kernel_initializer":{  
               "config":{  
                  "maxval":0.05,
                  "minval":-0.05,
                  "seed":null
               },
               "class_name":"RandomUniform"
            },
            "batch_input_shape":[  
               null,
               8
            ],
            "units":12
         },
         "class_name":"Dense"
      },
      {  
         "config":{  
            "kernel_regularizer":null,
            "bias_regularizer":null,
            "activation":"relu",
            "bias_constraint":null,
            "use_bias":true,
            "bias_initializer":{  
               "config":{  
 
               },
               "class_name":"Zeros"
            },
            "activity_regularizer":null,
            "kernel_constraint":null,
            "trainable":true,
            "name":"dense_2",
            "kernel_initializer":{  
               "config":{  
                  "maxval":0.05,
                  "minval":-0.05,
                  "seed":null
               },
               "class_name":"RandomUniform"
            },
            "units":8
         },
         "class_name":"Dense"
      },
      {  
         "config":{  
            "kernel_regularizer":null,
            "bias_regularizer":null,
            "activation":"sigmoid",
            "bias_constraint":null,
            "use_bias":true,
            "bias_initializer":{  
               "config":{  
 
               },
               "class_name":"Zeros"
            },
            "activity_regularizer":null,
            "kernel_constraint":null,
            "trainable":true,
            "name":"dense_3",
            "kernel_initializer":{  
               "config":{  
                  "maxval":0.05,
                  "minval":-0.05,
                  "seed":null
               },
               "class_name":"RandomUniform"
            },
            "units":1
         },
         "class_name":"Dense"
      }
   ],
   "class_name":"Sequential"
}
